package ru.ishchenko.task3;

import java.util.Scanner;

public class Main {

    public static void main(String[] args) {

        /*Написать программу для поиска минимального из двух чисел.
        int a,b;

        System.out.println("Введите первое число");
        Scanner in1 = new Scanner(System.in);
        a = in1.nextInt();

        System.out.println("Введите второе число");
        Scanner in2 = new Scanner(System.in);
        b = in2.nextInt();

        if (a>b){
            System.out.println("Первое число больше второго");
        }
         else if (a==b) {
            System.out.println("Первое число равное второму");
        }
         else {
            System.out.println("Второе число больше первого");
        }

        //Написать программу, которая описывает введенное число. Отрицательное оно число или положительное (или нулевое), чётное или нечётное.
        int e;

        System.out.println("Введите число");
         Scanner in3 = new Scanner(System.in);
         e = in3.nextInt();

         if (e<0){
             System.out.println("Число отрицательное");
         }
         else if (e==0){
             System.out.println("Число равное нулю");
         }
         else {
             System.out.println("Число положительно");
         }

         */

        // Написать программу для вывода на экран таблицы умножения.

        int i = -1;
        do {
            i = i - 1;
        }while (i>0);
        System.out.println(i);
        }
    }


